{
  "about-me": "Über mich",
  "my-skills": "Meine Skills",
  "my-works": "Projekte",
  "contact-me": "Kontakt",
  "resume-btn": "Resume",
  "hi": "Hi, ich bin...",
  "webdev": "Webentwicklerin",
  "about": "Es war einmal eine Büroangestellte, die “Was ist CSS?” googelte, während sie versuchte, eine Website für ihren Nebenjob als Katzensitterin einzurichten.\nHeute, ein paar Jahre später, bin ich mit einer soliden Grundlage in der Webentwicklung und einem unermüdlichen Lerndrang ausgestattet und bereit, nie mehr zurückzublicken und aus meiner Passion für Coding eine erfolgreiche Karriere zu schmieden. (Ich mag allerdings immer noch Katzen.)",
  "about-2": "Ich glaube, dass die perfekte Web-Applikation nicht nur einwandfrei funktioniert, sondern auch einen bleibenden Eindruck hinterlässt. Angetrieben von meinem Enthusiasmus für Technologie und Design bin ich bestrebt, meine Kreativität, meine Problemlösungsmentalität und mein Engagement einzusetzen, um eindringliche Online-Erlebnisse zu schaffen, die die Nutzer begeistern und die Erwartungen der Kunden übertreffen.",
  "about-3": "Ich bin derzeit auf der Suche nach Möglichkeiten und möchte mich einem Team anschließen, in dem ich meine Fachkenntnisse weiter ausbauen und beruflich wachsen kann. Wenn Du gluabst, dass ich eine wertvolle Ergänzung für Dein Team sein könnte, würde ich mich freuen, von Dir zu hören!",
  "and-I": "...und ich",
  "create": " kreiere Dinge mit:",
  "some": "Einige",
  "things": " der Dinge, die ich entwickelt habe:",
  "read-more": "Weiterlesen",
  "catspotter-summary": "Eine Community-Web-App, die verloren gegangenen Katzen hilft, nach Hause zu kommen.\nMit leistungsstarken Visualisierungstools, Infoblättern, interaktiven Karten und SVGs, einem Datenabgleichsalgorithmus, einstellbaren Standortpräferenzen und detaillierten Filtermöglichkeiten bietet diese Fullstack Applikation alles, was ein Nutzer braucht, um verlorene Katzen schnell zu finden und der Held des Tages zu sein.",
  "bird-summary": "Die App, die jeder Naturliebhaber braucht: Sie hilft dir zu entscheiden, was zu tun ist, wenn du ein Vogelbaby findest. Dieser benutzerfreundliche Fragebogen wurde in React erstellt und verwendet eine bedingte Darstellung, die auf den Antworten des Users basiert.",
  "react-libraries": "React-Bibliotheken",
  "cooking-summary": "Ein Fullstack-Projekt zum Hochladen, Teilen und Speichern von Rezepten im eigenen Rezeptbuch des angemeldeten Benutzers. Ursprünglich mit Contentful gebaut, aber später modifiziert, um meine eigene RESTful API für die Benutzer- und Rezeptverwaltung zu verwenden.",
  "other": "Andere",
  "noteworthy": " bemerkenswerte ",
  "projects": "Projekte:",
  "usagi-summary": "Du hast keine Idee, was zu kochen? Frag den Bunny! Eine App, um mir mit randomisierten, aber filterbaren Kochideen zu helfen.",
  "mini-yelp": "Mini YELP-Ähnlicher Server",
  "mini-yelp-summary": "Ein Express-Server, der mehrere Routen für den Backend-Teil eines kollaborativen Fullstack-Projekts bereitstellt, um neue Restaurants auf einer Website aufzulisten und hinzuzufügen. ",
  "ip-summary": "Eine kleine, kollaborative, einseitige App, die die IP-Adresse des Users auf einer Karte anzeigt, zusammen mit einigen zusätzlichen Informationen über das Land.",
  "check-out": "Besuche meine ",
  "github": "GitHub",
  "check-out-2": "-Seite, um alle anderen Projekte zu checken, an denen ich gearbeitet habe",
  "get": "Nimm",
  "touch": " Kontakt auf:",
  "chat": "Lass uns plaudern oder sieh dir mein ",
  "profile": "-Profil an, wenn du mehr über mich wissen möchtest.",
  "linkedin": "LinkedIn",
  "built-with": "Gebaut mit ",
  "by": " von Anna Hittaller © 2023",
  "send": "Senden",
  "project-details": "Projekt Details",
  "features": "Wichtigste Funktionen:",
  "challenges" :"Herausforderungen & Lösungen:",
  "tech": "Verwendete Technologien:",
  "back": "Zurück zur Übersicht",
  "p1-1": "Stell dir eine Welt vor, in der keine entlaufene Katze unbemerkt bleibt. Das ist es, was Catspotter erreichen will.",
  "p1-2": "Catspotter ist eine beeindruckende Community-Webapp, die entwickelt wurde, um die rasche Rückführung entlaufener Katzen zu ihren Besitzern zu erleichtern, indem die kollektive Kraft von Nachbarschaften und Gemeinschaften genutzt wird. Catspotter wurde bei mir als Abschlussprojekt für das Web- und App-Entwickler-Bootcamp der WBS Coding School entwickelt und ermöglicht es den Nutzern, Katzensichtungen zu melden, entlaufene Katzen zu registrieren, Match-Benachrichtigungen zu erhalten und all die verschiedenen Daten auf einer interaktiven Karte zu visualisieren.",
  "f11-s": "Katzen sichten und melden:",
  "f11-u": "Die Power der Community ausnutzen:",
  "f11-span": "Die User können Katzensichtungen melden und so zu den gemeinsamen Suchbemühungen nach entlaufenen Stubentigern beitragen.",
  "f11-u1": "Visualisierung zu helfen:",
  "f11-span1": "Neben der Bildupload-Möglichkeit dienen die angepassten Platzhalter-SVGs als schnelles und effektives Visualisierungstool, wenn keine Fotos der Katze verfügbar sind.",
  "f11-u2": "Umfassende Infoblätter:",
  "f11-span2": "Für jede gemeldete Katze stehen ausführliche Infoblätter zur Verfügung, die essentielle Daten wie Beschreibungen (Farbe, Muster, Haarlänge usw.), Kontaktinformationen zur Besitzer und ein Foto enthalten.",
  "f12-s": "Registrierung verlorener Katzen:",
  "f12-u": "Verbindung zu den Besitzern:",
  "f12-span": "Katzenbesitzer können wichtige Informationen über ihre entlaufenen Haustiere weitergeben, darunter Fotos, Beschreibungen und den letzten bekannten Aufenthaltsort sowie ihre eigenen Kontakte.",
  "f12-u1": "Verstärkung der Reichweite von Meldungen:",
  "f12-span1": "Durch die Benachrichtigung der Gemeinschaft steigen die Chancen auf eine sichere und rechtzeitige Wiedervereinigung zwischen entlaufenen Katzen und ihren Besitzern.",
  "f13-s": "Intelligente Benachrichtigungen über Matches:",
  "f13-u": "Erweiterter Algorithmus:",
  "f13-span": "Der intelligente Matching-Algorithmus von Catspotter lässt die User wissen, wenn ihre gemeldeten Sichtungen mit den Details einer verlorenen Katze übereinstimmen und umgekehrt. Farbe, Muster, Datum des Verschwindens und der Sichtung sowie die Entfernung werden ebenfalls berücksichtigt.",
  "f14-s": "Interaktive Kartenvisualisierung:",
  "f14-u": "Geografischer Einblick:",
  "f14-span": "Powered by Leaflet, the dynamic map displays reported cat sightings and lost cat locations, offering a clear visual representation of activity, using different custom map markers to help differentiate between lost or seen cat data on the first glance.",
  "f14-u1": "Gebiet von Interesse:",
  "f14-span1": "Die Benutzer können konzentrierte Gebiete mit Katzenaktivitäten identifizieren und so die gezielte Suche unterstützen.",
  "f14-u2": "Verbesserte Suche:",
  "f14-span2": "Die Verfügbarkeit umfassender Informationen und die verfügbaren Filteroptionen rationalisieren die Such- und Identifizierungsprozesse.",
  "f15-s": "Benutzerdefinierte Standortpräferenzen:",
  "f15-u": "Maßgeschneiderte User-Gebiete:",
  "f15-span": "Die User können ihre Standortpräferenzen anpassen und gewünschte Gebietsradien festlegen, um relevante Benachrichtigungen basierend auf der Nähe zu gemeldeten Sichtungen zu erhalten, was eine personalisierte Erfahrung in der gesamten App ermöglicht.",
  "future": "Zukünftige Entwicklung:",
  "future-p": "Catspotter ist ein laufendes Projekt (derzeit Version 1.0) mit Plänen für eine kontinuierliche Entwicklung und Funktionserweiterung. Zu den bevorstehenden Änderungen gehören die Verfeinerung bestehender Funktionen, die Optimierung und Überarbeitung der Codebasis und die Einführung neuer Funktionen, um die Wirkung der App weiter zu verstärken. Deployment Link kommt bald!",
  "challenges-p": "Die Entwicklung von Catspotter stellte mich vor eine Reihe spannender Herausforderungen, die mich an die Grenzen meiner Entwicklungsfähigkeiten brachten. Jedes Hindernis wurde mit Hingabe und Innovation gemeistert. Das Ergebnis ist eine visuell ansprechende und funktionale Applikation:",
  "ch1": "Präzision des Matching-Algorithmus:",
  "ch1-span": "Entwicklung eines Matching-Algorithmus, der relevante Katzensichtungen und Meldungen über entlaufene Katzen genau identifiziert. Um nur relevante Datenübereinstimmungen anzeigen zu können, implementierte ich einen mehrstufigen Algorithmus, der verschiedene Faktoren wie Ort, Zeit und Beschreibung berücksichtigt, um die Genauigkeit zu verfeinern.",
  "ch2": "Benutzerauthentifizierung und Datensicherheit:",
  "ch2-span": "Gewährleistung der Sicherheit von Benutzerdaten und Verhinderung von unbefugtem Zugriff. Ich habe Benutzerregistrierungs- und Anmeldefunktionen mit sicherem Passwort-Hashing implementiert. Ich habe JSON Web Tokens (JWT) für die Benutzerauthentifizierung und -autorisierung verwendet.",
  "ch3": "Standortbezogene Benachrichtigungen:",
  "ch3-span": "Implementierung von standortbasierten Benachrichtigungen für User, die sich in der Nähe von übereinstimmenden Katzensichtungen befinden. Ich habe eine benutzerfreundliche Interface entworfen, die es den Usern ermöglicht, ihr Gebiet und ihre Benachrichtigungspräferenzen einzustellen und anzupassen, und gleichzeitig wurde eine Backend-Logik integriert, um maßgeschneiderte Updates zu liefern.",
  "ch4": "Leistung der Kartenvisualisierung:",
  "ch4-span": "Optimierung der Leistung der interaktiven Karte, um die wachsende Zahl der gemeldeten Katzenaktivitäten zu bewältigen. Ich habe die Clustering- und Marker-Optimierungstechniken von Leaflet eingesetzt, um die Reaktionsfähigkeit der Karte zu verbessern und eine reibungslose Benutzererfahrung zu gewährleisten. Außerdem habe ich verschiedene Leaflet-Plugins integriert, um die Möglichkeiten der Standortsuche weiter zu verbessern.",

  "p2-1": "Cooking Light ist eine Fullstack-Webapp, die als digitale Rezeptsammlung dient und es den Usern ermöglicht, Rezepte hochzuladen, zu speichern und zu entdecken. Die Applikation bietet eine nahtlose Erfahrung für kulinarische Enthusiasten, um ihre Lieblingsrezepte zu teilen und eine personalisierte Sammlung zu erstellen. Die App verfügt über ein responsives Design, um eine optimale Benutzererfahrung auf verschiedenen Geräten und Bildschirmgrößen zu gewährleisten.",
  "p2-2": "Das Projekt wurde zunächst kollaborativ im Team mit Contentful als Headless CMS erstellt und später individuell modifiziert, um die Erstellung von Fullstack-Apps mit Routing-Endpunkten und RESTful-APIs mit Hilfe von Express Server und Node zu üben.",
  "f21-s": "Rezept-Management:",
  "f21-u": "CRUD-Operationen:",
  "f21-span": "User können ihre Rezepte erstellen, lesen, aktualisieren und löschen.",
  "f21-u1": "Bild-Upload:",
  "f21-span1": "Integriertes Hochladen von Bildern für Rezeptillustrationen.",
  "f21-u2": "Hero-Image-Karussel:",
  "f21-span2": "Auf der Startseite wird eine Hero-Sektion mit einem dynamisch gerenderten Rezept-Karussell angezeigt.",
  "f21-u3": "Like-Funktionalität:",
  "f21-span3": "User können die einzelnen Rezepte liken und in ihrem eigenen Rezeptbuch innerhalb der App speichern. Diese Funktion ist nur für eingeloggte User verfügbar.",
  "f22-s": "User-Management:",
  "f22-u": "CRUD-Operationen:",
  "f22-span": "User können ihre Profile registrieren, aktualisieren und löschen. Benutzerdaten werden in Local Storage gespeichert, um Rezepte in eigenen Rezeptbüchern speichern zu können.",
  "f23-s": "MongoDB Datenbank:",
  "f23-u": "Datenspeicherung:",
  "f23-span": "Verwendung von MongoDB zur Speicherung von Benutzerinformationen, Rezepten und zugehörigen Daten.",
  "f23-u1": "Mongoose Schema:",
  "f23-span1": "Entwurf von Datenmodellen mit Mongoose für konsistente und organisierte Datenbankinteraktionen.",
  "f24-s": "Express Server:",
  "f24-u": "RESTful API:",
  "f24-span": "Entwicklung einer RESTful-API mit Express für die Client-Server-Kommunikation.",
  "f24-u1": "Endpunkt-Routing:",
  "f24-span1": "Strukturierte API-Routen für die Benutzer- und Rezeptverwaltung. ",
  "ch21": "Bild-Upload:",
  "ch21-span": "Ein effizienter Umgang mit Bild-Uploads für Rezept-Illustrationen ist ein Muss beim Aufbau einer Koch-Website. Ich entschied mich für den Einsatz der Multer-Bibliothek zur Verwaltung von Bild-Uploads und Speicherung.",
  "ch22": "Umstellung von einem Headless CMS auf ein eigenes Backend:",
  "ch22-span": "Es war eine Herausforderung, die Endpunkte in Express neu zu erstellen, um die gleiche Funktionalität beizubehalten und noch mehr Routen für den Bild-Upload hinzuzufügen. Ich habe das bestehende Frontend beibehalten und die Backend-Teile des Projekts umgeschrieben, damit es weterhin reibungslos läuft.",
  "ch23": "Kommunikation und Zusammenarbeit im Team:",
  "ch23-span": "Effektive Kommunikation innerhalb eines geografisch verteilten Teams. Um diese Schwierigkeiten zu überwinden, haben wir regelmäßige Videomeetings, Discord-Kanäle und Projektmanagement-Tools eingeführt, um die Kommunikation zu erleichtern, den Fortschritt zu verfolgen und Aufgaben zuzuweisen. Außerdem mussten wir Codeänderungen und Zusammenführungen koordinieren. Zu diesem Zweck nutzten wir Git und GitHub, um Änderungen an der Codebasis zu verwalten, Code zu überprüfen und Konflikte zu lösen. Die Zuweisung von Aufgaben und die Sicherstellung, dass die Beiträge der einzelnen Teammitglieder mit den Projektzielen übereinstimmen, war ebenfalls nicht einfach, aber nach der Zuweisung von Rollen und Verantwortlichkeiten auf der Grundlage der individuellen Stärken und Kompetenzen konnten wir effektiv zusammenarbeiten und das Projekt fristgerecht abliefern, und wir waren sogar in der Lage, einige zusätzliche Funktionen hinzuzufügen (wie das Karussell für Hero-Images und die Back-to-Top-Button). "


}