{
  "about-me": "About me",
  "my-skills": "My skills",
  "my-works": "My works",
  "contact-me": "Contact me",
  "resume-btn": "Resume",
  "hi": "Hi there, I'm",
  "webdev": "web developer",
  "about": "Once upon a time, an office worker googled “What is CSS?”, while trying to set up a website for her cat sitting side job.\nFast forward to today, a few years later, armed with a solid foundation in web development and a relentless drive to learn, I am ready to never look back and to forge a successful career out of my passion: coding. (I still like cats though.)",
  "about-2": "I believe that the perfect web application not only functions flawlessly but also leaves a lasting impression. Driven by my enthusiasm for both technology and design, I am eager to use my creativity, problem-solving mindset and dedication to craft immersive online experiences that delight users and exceed client expectations.",
  "about-3": "I am currently seeking opportunities and looking to join a team where I can further enhance my skills and grow professionally. If you believe that I could be a valuable addition to your team, I would love to hear from you!",
  "and-I": "...and I",
  "some": "Some of",
  "read-more": "Read more",
  "create": " create things with:",
  "things": " the things I've built:",
  "catspotter-summary": "A community web app to help lost cats get home.\nWith powerful visualization tools, infosheets, interactive maps and SVGs, data matching algorithm, adjustable location preferences and detailed filtering possibilities, this fullstack application has everything a user may need to be able to help finding lost cats quickly and to be the hero of the day.",
  "bird-summary": "The app every nature lover needs: it helps you to decide what to do, when finding a baby bird. Built in react, this easy-to-use questionnaire uses conditional rendering based on the user's answers.",
  "react-libraries": "React libraries",
  "cooking-summary": "A fullstack project to upload, share, and save recipes to the logged in user's own recipe book. Originally built with Contentful, but later modified to use my own RESTful API for user and recipe management.",
  "other": "Other",
  "noteworthy": " noteworthy ",
  "projects": "projects:",
  "usagi-summary": "Don’t have any ideas what to cook? Ask the bunny! An app to help me with randomized but filterable cooking ideas.",
  "mini-yelp": "Mini YELP-Like Server",
  "mini-yelp-summary": "An Express server providing several routes for the backend part of a collaborative fullstack project, for listing and adding new restaurants on a website.",
  "ip-summary": "A small, collaborative one-page app to show the user’s IP address, along with their location on a map and some extra infos about their country.",
  "check-out": "Visit my ",
  "github": "GitHub",
  "check-out-2": " page to view all other projects I’ve been working on",
  "get": "Get",
  "touch": " in touch:",
  "chat": "Let's have a chat or check out my",
  "profile": "profile if you would like to know more about me.",
  "linkedin": "Linkedin",
  "built-with": "Built with ",
  "by": " by Anna Hittaller © 2023",
  "send": "Send",
  "project-details": "Project details",
  "features": "Key features:",
  "challenges" :"Challenges & solutions:",
  "tech": "Technologies used:",
  "back": "Back to the overview",
  "p1-1": "Imagine a world where no lost cat goes unnoticed. This is what Catspotter wants to achieve.",
  "p1-2": "Catspotter is an impressive full-stack community web application designed to facilitate the swift return of lost cats to their owners by leveraging the collective power of neighborhoods and communities. Built as the final project for the WBS Coding School web & app developer bootcamp, Catspotter empowers users to report cat sightings, register lost cats, receive match notifications, and visualize all the different data on an interactive map.",
  "f11-s": "Cat spotting and reporting:",
  "f11-u": "Leveraging the power of the community:",
  "f11-span": "Users can report cat sightings they encounter, contributing to a ollaborative effort to locate lost felines.",
  "f11-u1": "Helping visualization:",
  "f11-span1": "In addition to the image upload possibility, the customized placeholder SVGs serve as a quick and effective visualization tool when no photos of the cat are available.",
  "f11-u2": "Comprehensive infosheets:",
  "f11-span2": "Detailed infosheets are available for each reported cat, containing essential data such as descriptions (color, pattern, hair length, etc.), contact details, and photo.",
  "f12-s": "Lost cat registration:",
  "f12-u": "Connecting owners:",
  "f12-span": "Cat owners can share crucial information about their lost pets, including photos, descriptions, and last known locations, as well as their own contacts.",
  "f12-u1": "Amplifying outreach:",
  "f12-span1": "By notifying the community, the chances of a safe and timely reunion between lost cats and their owners increase.",
  "f13-s": "Intelligent match notifications:",
  "f13-u": "Advanced algorithm:",
  "f13-span": "Catspotter's smart matching algorithm let users know when their reported sightings align with the details of a lost cat, and vice versa. Color, pattern, lost and seen dates and vicinity are also taken into account.",
  "f14-s": "Interactive map visualization:",
  "f14-u": "Geographic insight:",
  "f14-span": "Powered by Leaflet, the dynamic map displays reported cat sightings and lost cat locations, offering a clear visual representation of activity, using different custom map markers to help differentiate between lost or seen cat data on the first glance.",
  "f14-u1": "Areas of interest:",
  "f14-span1": "Users can identify concentrated areas of cat-related activity, aiding focused search efforts.",
  "f14-u2": "Enhanced search:",
  "f14-span2": "The availability of comprehensive information and the available filtering options streamline search and identification processes.",
  "f15-s": "User-defined location preferences:",
  "f15-u": "Customized user areas:",
  "f15-span": "Users can tailor their location preferences and set desired area radii to receive relevant notifications based on proximity to reported sightings, providing a personalised experience throughout the app.",
  "future": "Future development:",
  "future-p": "Catspotter is an ongoing project (at the moment version 1.0) with plans for continuous development and feature enhancement. Upcoming changes include refining existing functionalities, optimizing and refactoring codebase, and introducing new features to further amplify the app's impact. Deployment link coming soon!",
  "challenges-p": "Creating CatSpotter presented a series of exciting challenges that pushed the boundaries of my development skills. Each obstacle was met with dedication and innovation, resulting in a visually appealing and functional application:",
  "ch1": "Matching algorithm precision:",
  "ch1-span": "Developing a matching algorithm that accurately identifies relevant cat sightings and lost cat reports. To be able to show relevant data matches only, I implemented a multi-step algorithm that considers various factors such as location, time, and description to refine accuracy.",
  "ch2": "User authentication and data security:",
  "ch2-span": "Ensuring the security of user data and preventing unauthorized access. I implemented user registration and login functionality with secure password hashing. Utilized JSON Web Tokens (JWT) for user authentication and authorization.",
  "ch3": "Location-based notifications:",
  "ch3-span": "Implementing location-based notifications for users within the vicinity of matching cat sightings. I designed a user-friendly interface that makes users able to adjust and customize their area and notification preferences, while integrating backend logic to deliver tailored updates.",
  "ch4": "Map visualization performance:",
  "ch4-span": "Optimizing the performance of the interactive map to handle a growing volume of reported cat activities. I utilized Leaflet's clustering and marker optimization techniques to enhance map responsiveness and maintain a smooth user experience, as well as integrating different Leaflet plugins to further enhance the possibilities for location searching."


}